{
    "titles": [
        "Portraying data incorrectly",
        "The issues with using pie charts",
        "Scaling can be misleading",
        "Colour schemes are important",
        "More on scaling",
        "Incorrectly made pie charts",
        "Using colour to leave the wrong impression"
    ],
    "intros": [
        "Bad graph practices can take a lot of forms, some more obvious and intentionally used than others. Take a look at the two graphs below - one is the original, created by Georgia's Department of Public Health and the other is a reworked version using the same data. Why do you think they look so different? Pay attention to how the dates and counties on both are organized.",
        "Pie charts are visually pleasing and a great way to represent data as parts of a whole - for example when working with percentages. However, not every dataset is appropriate for a pie chart. The graphs below are a pie chart featured on WCVB Channel 5 Boston and a reworked version of the same graph. Why do you think a different kind of graph was used when remaking the original?",
        "When looking at graphs we naturally pay attention to the visuals first - how the lines curve, what the colours suggest, etc. Looking at the numbers on graphs is mostly done just for information after the viewer has already gotten an initial impression of the data. However, this tendency can be exploited by those creating the graphs - below are shown two versions of the same data, its original presentation on Fox News Channel, and a reworked version. Why do you think the two visuals differ?",
        "Since graphs are a visual tool, it is not only the data and whether it is presented accurately that matters. Other aspects of the presentation are equally important - for example, the colours one chooses for their graphs can completely change the way data is perceived. The original map (called more specifically a choropleth map) displayed below was used to show the number of COVID-19 cases worldwide. What causes such a difference in perception between it and its reworked version? (It is more than just the colours!)",
        "Bad graphs appear not only in Western Media. The two graphs shown below are a visualization of the growth and number of COVID-19 cases shown in Russian media and a (translated) rework of part of the graph. Why do the two differ from each other?",
        "Pie charts can be tricky, even when working with a dataset of percentages that add up to 100. The original graph (which really is more of a doughnut chart but it follows the same principles as a pie chart) below illustrates what media coverage different European countries had relating to COVID-19. While there are a couple of issues with it, addressing them is not straightforward, hence the two reworked versions. Why do you think this particular graph required more than one remake?",
        "Not all graphs that can unintentionally confuse the viewer make some obvious bad graph mistakes. Sometimes there are subtleties that are quite hard to spot. The original graph below presents the growth in COVID-19 cases in the state of Arizona (above) and Navajo county (below) and the reworked graph is almost identical to it, with the exception of a couple of details. Why do you think the graphs are slightly different?"

    ],
    "descs" : [
        "If you looked closely, you probably noticed that the dates in the original graph are out of order - dates in May are even put before dates in April. That has most likely been done to portray a downward tendency in the COVID-19 cases, which is probably why the counties are also never in the same order on different dates. When the data is ordered correctly, it is much harder to identify an ongoing declining trend. Since this is a very obvious tampering with the data, such a graph could very well have been produced with the intention of deceiving the viewer.",
        "It is probably quite obvious what is wrong with the original graph - the percentages given do not add up to 100% - rather to 178%. Portraying this data on a pie chart not only uses the wrong kind of graph (a pie chart conventionally shows what part of the whole a value is and is expected to consist of a hundred percent total) but it also fails to represent the values properly - neither of the 60+ percent values are more than half of the pie, as they should be. This was most likely an honest mistake - an online survey may have allowed people to check more than one of the answers and whoever was in charge of creating the graph might not have been aware of this, leading to them choosing an inappropriate kind of graph. Using a bar chart would have been much more suitable, allowing for the values to be accurately represented.",
        "The creators of this particular graph seem to have been intentionally trying to misrepresent some data. For one, the numbers on the vertical axis do not increase at the same rate - they go from 0 to 5, then all the way to 20 and the space between 5 and 20 is no more than that between 0 and 5. This makes the curve appear far less steep than it actually is. Moreover, the dates on the horizontal axis follow the same trend - at the beginning, the dates have a 9-day interval between them, which then is reduced to a 4-day interval. This makes the period of increasing cases look like it is the same length as the period with almost no cases. When correctly plotted, it is quite clear that this data indicates a sharp spike in cases that the original graph is trying hard to present as gradual.",
        "It is a bit baffling why the creators of the choropleth map chose this particular colour scheme - it is a bit of an eyesore and it does not draw the attention of the viewer towards the countries with the most cases. At a first glance, you most likely noticed the bright pink countries such as Russia and Canada, even though the countries where COVID-19 is the most severe are coloured in red (the USA for example). This may cause confusion if the viewer only spares a cursory glance toward the map. The globe projection used is also interesting - the continents are presented at an angle that makes Greenland appear as big as, if not bigger than, South America. It is a strange choice to make, considering the low population in Greenland will surely result in very few cases there. Such manipulation of perception was most likely done to give more importance to regions with fewer cases. Upon using a different colour scheme and globe projection, one can more clearly recognize the countries with the most cases, without being distracted by the unusual look of the map.",
        "This graph can seem a bit confusing to a casual viewer - for one, the red on black does not provide the best conditions for reading the numbers above the bars. This would not have been an issue had an actual vertical axis been used instead of numbering each bar individually. It seems like that was not done because no clear scaling was used when making the bar chart (upper part of the graph) - the bars are presented in a way that suggests a flattening curve (the values on the bars at the end appear similar to each other, giving the idea that the number of cases is not changing much), but when one actually looks at the numbers, they seem to be telling a different story. The lower part of the graph (the line chart) can also be a bit hard to understand at first - it is supposed to represent the new cases each day, yet the viewer is expected to infer that it uses the dates from the bar chart as a reference. The line also follows no kind of scale – the lack of a vertical axis allowed the graph creator to draw it however they wished to – and seems to be drawn to simulate realism while still giving the impression that the curve is flattening. Upon presenting the data in a cleaner way and with proper scaling, one can clearly see that is not the case - just as before, incorrect scaling is used to hide a sharp spike in cases.",
        "A simple textual mistake in the graph's description is claiming that it represents all European countries, but featuring only countries which were part of the European Union before Brexit. While that is easily fixable, there are a couple of more complicated issues - the pie chart features multiple countries with 0% coverage. They should not have been included as part of the doughnut, yet they have colours associated with them and lines that connect them to the chart. Moreover, this particular dataset features a lot of small percentage values, which will inevitably get lost when presented on a pie chart and the countries are not sorted in any meaningful way, creating a somewhat messy graph. One solution for these issues would be the present the data as a bar chart and sort the countries alphabetically - this gives some emphasis to the countries with 0% coverage or very small coverage and is easier to follow. However, the most important aspect of a pie chart - representing the values as part of a whole - would be lost. An alternative solution would be to make a new pie chart, sorting the countries by their percentages and only mentioning those with 0% in the legend, without associating them with a colour. This keeps the spirit of the original graph, but the viewer still needs to refer to the legend when they wish to check a country with a low percentage value. Which one of the two reworked versions is better depends on the viewer and the situation – for example, if you wish to show which countries got the most coverage, a pie chart will be a nice visual way to highlight them.",
        "The graph here is actually made quite well. The only issues are the lack of a vertical axis and the gradient used. No vertical axis is quite self-explanatory - the lack of one means that people must read the numbers above the bars, which are not always present. Showing both axes is also standard practice when visualizing data – a lack of one axis means that you do not know for certain if the scaling is correct. The problem with the gradient is a bit subtler - in both parts of the graph (the two bar charts) the higher values are coloured in progressively brighter red compared to the lower values. However, the gradients are scaled independently for each bar chart, leading to the highest values in the state and in Navajo county being the same colour. The only issue is that those values are actually quite different - in the thousands for the state and less than a hundred for the county. This can create the impression that cases in the state and Navajo county are of similar proportions, especially without a vertical axis. Using both axes and a uniform gradient manages to present the data in the same fashion while making it clear that the state-wide cases are much more than those in a single county."
    ],
    "options": [
        ["The scaling used is improper", "The ordering of items on the horizontal axis (x-axis) is not correct", "The order in which the counties are presented is incorrect", "An unusual colour scheme has been used", "The wrong kind of graph has been used"],
        ["A pie chart was not appropriate given the values of the data", "The colour scheme used is not appropriate", "The chart is hard to understand/make sense of", "The data was not accurately represented"],
        ["The dates on the horizontal axis are in the wrong order", "The numbers shown on the vertical axis have not been chosen correctly", "A line graph should not have been used with this data", "The dates on the horizontal axis do not seem to have the same intervals between them", "The graph is not presented clearly (regarding colour scheme, backgrounds, etc.)"],
        ["The map's colouring does not match the legend", "The colour scheme chosen is not suitable", "This is not an appropriate projection of the globe", "Using a map representation was not needed with this dataset"],
        ["There is no clear vertical axis, aside from the numbers on the separate bars", "The scaling seems incorrect", "The graph is not well-presented (relating to colour scheme, background, etc.)", "The line in the lower part of the graph does not seem to follow any sort of vertical axis", "The two parts of the graph (bars and line) should not have been presented together"],
        ["The countries in the graph do not represent all of the European countries", "A pie chart should not have been used on this dataset", "The graph can be confusing and hard to understand", "The colours used are too distracting", "Countries with 0% coverage are not displayed well"],
        ["Incorrect scaling is used", "The two bar charts (one for the whole state, one for the county) should not have been presented together", "There is no vertical axis", "The colour gradient used can be misleading "]
    ],
    "correct": [
        ["two", "three"],
        ["one", "four"],
        ["two", "four"],
        ["two", "three"],
        ["one", "two", "three", "four"],
        ["one", "three", "five"],
        ["three", "four"]
    ]
}